#### Loan Eligibility Prediction

In [15]:
# import kagglehub

In [16]:
# # Get the dataset
# path = kagglehub.dataset_download("architsharma01/loan-approval-prediction-dataset")
# print(path)

In [2]:
# Import the necessary libraries
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline

In [34]:
loan_dataset = pd.read_csv("/Users/obianujuanuma/Documents/Datasets/loan_approval_dataset.csv")
loan_dataset.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value,loan_status
0,1,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,4,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

In [35]:
# Data types of each column
loan_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4269 entries, 0 to 4268
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   loan_id                    4269 non-null   int64
 1    no_of_dependents          4269 non-null   int64
 2    education                 4269 non-null   object
 3    self_employed             4269 non-null   object
 4    income_annum              4269 non-null   int64
 5    loan_amount               4269 non-null   int64
 6    loan_term                 4269 non-null   int64
 7    cibil_score               4269 non-null   int64
 8    residential_assets_value  4269 non-null   int64
 9    commercial_assets_value   4269 non-null   int64
 10   luxury_assets_value       4269 non-null   int64
 11   bank_asset_value          4269 non-null   int64
 12   loan_status               4269 non-null   object
dtypes: int64(10), object(3)
memory usage: 433.7+ KB

In [36]:
# Number of columns / series and rows / records
loan_dataset.shape

(4269, 13)

In [37]:
# Summary Statistics for the dataset
loan_dataset.describe()

,loan_id,no_of_dependents,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value
count,4269.000000,4269.000000,4.269000e+03,4.269000e+03,4269.000000,4269.000000,4.269000e+03,4.269000e+03,4.269000e+03,4.269000e+03
mean,2135.000000,2.498712,5.059124e+06,1.513345e+07,10.900445,599.936051,7.472617e+06,4.973155e+06,1.512631e+07,4.976692e+06
std,1232.498479,1.695910,2.806840e+06,9.043363e+06,5.709187,172.430401,6.503637e+06,4.388966e+06,9.103754e+06,3.250185e+06
min,1.000000,0.000000,2.000000e+05,3.000000e+05,2.000000,300.000000,-1.000000e+05,0.000000e+00,3.000000e+05,0.000000e+00
25%,1068.000000,1.000000,2.700000e+06,7.700000e+06,6.000000,453.000000,2.200000e+06,1.300000e+06,7.500000e+06,2.300000e+06
50%,2135.000000,3.000000,5.100000e+06,1.450000e+07,10.000000,600.000000,5.600000e+06,3.700000e+06,1.460000e+07,4.600000e+06
75%,3202.000000,4.000000,7.500000e+06,2.150000e+07,16.000000,748.000000,1.130000e+07,7.600000e+06,2.170000e+07,7.100000e+06
max,4269.000000,5.000000,9.900000e+06,3.950000e+07,20.000000,900.000000,2.910000e+07,1.940000e+07,3.920000e+07,1.470000e+07

In [38]:
# Drop the Loan ID field as it is not necessary for prediction
loan_dataset = loan_dataset.drop(['loan_id'], axis=1)
loan_dataset.head()

,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value,loan_status
0,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

#### Data Cleaning

In [39]:
# Check for null values
loan_dataset.isnull().sum()

no_of_dependents            0
education                   0
self_employed               0
income_annum                0
loan_amount                 0
loan_term                   0
cibil_score                 0
residential_assets_value    0
commercial_assets_value     0
luxury_assets_value         0
bank_asset_value            0
loan_status                 0
dtype: int64

In [40]:
# Check for null values
loan_dataset.isna().sum()

no_of_dependents            0
education                   0
self_employed               0
income_annum                0
loan_amount                 0
loan_term                   0
cibil_score                 0
residential_assets_value    0
commercial_assets_value     0
luxury_assets_value         0
bank_asset_value            0
loan_status                 0
dtype: int64

In [41]:
# Check for duplicates
loan_dataset.duplicated().sum()

0

In [ ]:
# Remove trailing and leading whitespaces from column names
loan_dataset.columns = [col.strip() for col in loan_dataset.columns]

# Clean leading or trailing spaces in categorical columns
loan_dataset['education'] = loan_dataset['education'].str.strip().str.title()
loan_dataset['loan_status'] = loan_dataset['loan_status'].str.strip().str.title()
loan_dataset['self_employed'] = loan_dataset['self_employed'].str.strip().str.title()

#### Replace categorical values with numerical in categorical columns

In [ ]:
loan_dataset['education'] = loan_dataset['education'].replace({'Graduate': 1, 'Not Graduate':0})

/var/folders/2d/3sr2rbmd5dx8q2yvdrpymjfc0000gn/T/ipykernel_60672/583035437.py:5: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  loan_dataset['education'] = loan_dataset['education'].replace({'Graduate': 1, 'Not Graduate':0})

In [47]:
loan_dataset['education'].value_counts()

education
1    2144
0    2125
Name: count, dtype: int64

In [49]:
loan_dataset['loan_status'] = loan_dataset['loan_status'].replace({'Approved': 1, 'Rejected':0})

/var/folders/2d/3sr2rbmd5dx8q2yvdrpymjfc0000gn/T/ipykernel_60672/4018057802.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  loan_dataset['loan_status'] = loan_dataset['loan_status'].replace({'Approved': 1, 'Rejected':0})

In [50]:
loan_dataset['loan_status'].value_counts()

loan_status
1    2656
0    1613
Name: count, dtype: int64

In [51]:
loan_dataset['self_employed'] = loan_dataset['self_employed'].replace({'Yes': 1, 'No':0})

/var/folders/2d/3sr2rbmd5dx8q2yvdrpymjfc0000gn/T/ipykernel_60672/1683601870.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  loan_dataset['self_employed'] = loan_dataset['self_employed'].replace({'Yes': 1, 'No':0})

In [52]:
loan_dataset['self_employed'].value_counts()

self_employed
1    2150
0    2119
Name: count, dtype: int64

In [53]:
loan_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4269 entries, 0 to 4268
Data columns (total 12 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   no_of_dependents          4269 non-null   int64
 1   education                 4269 non-null   int64
 2   self_employed             4269 non-null   int64
 3   income_annum              4269 non-null   int64
 4   loan_amount               4269 non-null   int64
 5   loan_term                 4269 non-null   int64
 6   cibil_score               4269 non-null   int64
 7   residential_assets_value  4269 non-null   int64
 8   commercial_assets_value   4269 non-null   int64
 9   luxury_assets_value       4269 non-null   int64
 10  bank_asset_value          4269 non-null   int64
 11  loan_status               4269 non-null   int64
dtypes: int64(12)
memory usage: 400.3 KB